using System;
using System.Collections.Generic;
using System.Text;

namespace AlgorithmGarden.Algorithms.Others
{
    /*
    1+1=2
    定义。
    因果逻辑和确定性。确定性可以是定量的，2包含两个1；确定性可以是定性的，从原因推导出必然的结果。
    抽象。数学是对物理世界的抽象。
    */

    /*
    E=mC^2
    高速运动物体会带来：长度变短、时间变慢、质量变大。

    光子钟实验：
    一个光子在两面镜子之间来回，运动轨迹是上下直线，速度不变。
    ------
      .
    ------
    把光子钟放在一辆车上，这辆车左右来回地动。
    一个人在车上观看这个光子钟，另外一个人在旁边观看。
    车上的人看到的是光子上下来回。
    旁边的人看到：
    ------------------
        / \
       /   \
    ------------------
    根据速度=距离/时间，由于光速是恒定的，车上的人距离更短时间更长，旁边的人距离变长时间更短。
    */

    /*
    熵的定义，是热力学和信息论的基础
    信息熵  Information entropy
    世界也是不确定的
    概率分布函数
     */
}
